{"id":17208,"date":"2020-10-06T09:30:13","date_gmt":"2020-10-06T17:30:13","guid":{"rendered":"https:\/\/codefresh.io\/?p=17208"},"modified":"2020-10-19T10:00:51","modified_gmt":"2020-10-19T18:00:51","slug":"heck-continuous-integration-ci-delivery-cd-deployment-cdp","status":"publish","type":"post","link":"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/","title":{"rendered":"What the Heck Is Continuous Integration (CI), Delivery (CD), and Deployment (CDP)?"},"content":{"rendered":"<p>CI and CD tools are popular for a good reason. They help us automate the application lifecycle, fully or partially. However, the problem is that, in some cases, we are moving away from the core principles behind the CI and CD processes. Products on the market tend to “bend” the definitions of what CI and CD are so that their products can get “yet another sticker”.<\/p>\n<p>This is an attempt to bring sanity into the insane situation in which everything and nothing are CI and CD.<\/p>\n<p>Let’s start with the basic definitions. I promise I’ll make it simple as I can.<\/p>\n<p><strong>If you have an automated process that starts with a push to a code repository and ends with a release deployed to production without any human intervention, you are doing continuous deployment.<\/strong><\/p>\n<p><strong>If you have an automated process that starts with a push to a code repository and the only manual action is to confirm the desire to promote a release to production, you are doing continuous delivery.<\/strong><\/p>\n<p><strong>If you have an automated process that starts with a push to a code repository but ends in a way that manual actions are needed afterward, you are doing continuous integration.<\/strong><\/p>\n<p>Before we proceed, I need to clarify what pushing to a code repository really means within the context of CI and CD.<\/p>\n<p><strong>If we push changes to a code repository frequently, we can say that the process is continuous.<\/strong> What “frequently” means tends to differ from one organization to another. As a general rule, once a day can be characterized as frequent. Multiple times a day is better, but I will not hold it against you if you do it once a day.<\/p>\n<p>You must not use “tricks” to bend the process to your needs. If you push to a branch that does not trigger CI or CD processes, it does not count. In most cases, only pull requests and merges to the master\/production branch count. All the other branches are irrelevant. I do not care what you do inside a branch. The only thing that counts is how frequently you make pull requests and how often you merge to the master branch (unless you’re pushing directly to the master). To make things more complicated, making pull requests counts only if it triggers a CI or a CD pipeline.<\/p>\n<blockquote><p>Why did I say that only pull requests and merges to the master branch count? The answer is simple. There is no integration without integration. If we work in a separate branch, we do not know whether our code “integrates” with other people’s code until we make a PR or merge to master. Until then, our changes are isolated, so we can discard the word “integration”, just as we could dump the term “continuous” if we do not integrate frequently.<\/p><\/blockquote>\n<p>So, if you are making pull requests or pushing to the master branch frequently, you might be doing CI or CD. I cannot say, in that case, if you are really doing CI or CD. Much more is needed beyond “push frequency”. What I can tell, however, is that if you are NOT pushing often, you are neither doing CI nor CD.<\/p>\n<p>You might have everything fully automated. Still, without frequent integration, validation, and packaging, you are not continuous. In such cases, we might be able to say that your process is automated and that you are doing <strong>delayed integration<\/strong> or <strong>delayed delivery<\/strong>. Now, that does not necessarily mean that you are not doing well. Hey, if you have everything automated, but the processes are NOT running frequently, you are still better than many others.<\/p>\n<p>Nevertheless, there is no reason to call it continuous. Say that you are doing automation. That should be good enough.<\/p>\n<p>Now, if I go back to the CI, CD, and CDP definitions, we can spot a potential issue with at least two of them.<\/p>\n<h2 id=\"what-is-continuous-deployment\">What Is Continuous Deployment?<\/h2>\n<p>It is easy to deduce if someone is doing continuous deployment (CDP). <strong>Every single push to the master branch is deployed to production without human intervention.<\/strong> If we combine that with the frequency (e.g., once a day), we can say that no one can fake it. Answering this single question allows us to distinguish doers from fakers.<\/p>\n<p>That was the shortest explanation you probably ever heard from anyone. There’s not much more to it, so let’s move on.<\/p>\n<h2 id=\"what-is-continuous-delivery\">What Is Continuous Delivery?<\/h2>\n<p>Continuous delivery (CD) does allow people to fake it. One can say, everything is automated, and deployments to production are a push of a button. The problem is that quite a few companies are afraid of pushing that button. They are not comfortable doing it, mostly because they do not trust the process and the validations. So, there is often a separate process that allows only a “clairvoyant” few to press that button. If that’s the case, it is not continuous delivery. You might be doing CI while “faking” that you do CD.<\/p>\n<blockquote><p>I’m using the word “button” as if it could be any button. It indeed could, but, realistically, the only button that should be allowed to deploy something to production should be “merge to master” one available in pull requests. But, that is a separate subject of GitOps, which I will reserve for some other time.<\/p><\/blockquote>\n<p>One of the goals of continuous delivery is to produce artifacts that are deployable to production. It works only if we have full trust in the process and can choose to deliver any release to production, as long as it passed all the steps of a pipeline. There is no difference between continuous delivery and continuous deployment, except in that button. Both are producing artifacts that are deployable to production. The main difference is that, by applying continuous delivery, we are choosing NOT to deploy new releases to production automatically. It is not a technical decision. It is a business choice.<\/p>\n<p>Even though each release could be deployed to production, we might want to wait for the marketing department to start the campaign. We might want to tell users that a new feature is coming before they see it. And so on and so forth. There could be many reasons for continuous delivery instead of deployment, and none of them are technical. In both cases, we have full trust in the process.<\/p>\n<p>Are you still confused? Let me give you a step by step set of instructions on how you can see whether you are doing continuous delivery.<\/p>\n<ol type=\"1\">\n<li>Find a random person who has nothing to do with your project. If you’re not inspired, you can go to the nearest coffee shop, find a barista who just finished his shift, and tell him that he’s part of a social experiment.<\/li>\n<li>Open your laptop, log in, and open whichever tool you’re using that shows all the releases and has the “deploy to production” buttons next to each.<\/li>\n<li>Tell him to deploy any release he wants. If he does not know what “a release” is, tell him that he can press any button. Instruct him to close the laptop when finished.<\/li>\n<li>Go for a run around the block so that you do not influence him and, more importantly, so that you do not know which button he will click and which release will be deployed.<\/li>\n<li>Get the laptop without opening it. Go home and spend the rest of the day with your family. Do NOT attempt to check the status of your production cluster.<\/li>\n<\/ol>\n<p>If you do not get a heart attack during any of those steps, and if you do not end up getting fired, you are doing continuous delivery. You are so confident in the process that you know that <strong>any release is indeed deployable to production<\/strong>.<\/p>\n<p>Next, let’s move to continuous integration.<\/p>\n<h2 id=\"what-is-continuous-integration\">What Is Continuous Integration?<\/h2>\n<p>I am not sure what continuous integration really is because, over time, it became whatever anyone wants it to be. Some CI practitioners are only running unit tests. Others are also building artifacts. Some might be deploying apps to preview environments, while others might be running some functional tests after those deployments. That leads us to the main issue of continuous integration. We know where it starts (a push of a change to a code repository), but we do not know where it ends. It’s not really defined what “being integrated” means.<\/p>\n<p>The only thing certain about CI is that the process starts with a push to a code repository and ends somewhere. Where that “somewhere” is differs from one team to another. But that does not matter much. CI is an automated process, after which there are some manual actions.<\/p>\n<p><strong>What matters about CI is that we do not trust the process. We do not trust our automated tests. Otherwise, we would not need to run manual tests afterward.<\/strong><\/p>\n<p>We all know that the whole lifecycle of an application is a set of repetitive steps. We know that machines are better than humans at executing repetitive tasks. Yet, we do not trust the automation, so we have to take a look. We have to open the page of a Web app to see that it’s really there. We need to fill in some forms. We need to follow some links. We need to send some requests to the backend. We need to do all those things manually because we do not trust the automation we have or are incapable of writing code that does the automation.<\/p>\n<p>If all that makes you feel bad, here’s a bit of reassurance. I can give you the “it’s not you, it’s me” type of explanation one often gets when breaking up. In this context, “me” would be your legacy application that is untestable. It could be the architecture of the app created by someone who does not understand what “deployable frequently” means. It could be a silly separation into silos that prevents any notion of “continuous”. It can be many things, and they might be out of your control.<\/p>\n<p>Did that cheer you up? I hope it did since we are about to remove the word “and” from “CI and CD”, and I need you to be in a “happy place” when we get there.<\/p>\n<h2 id=\"there-is-no-and-in-ci-and-cd\">There Is No “And” In “CI And CD”<\/h2>\n<p>I often hear the expression “CI and CD”. That’s just silly. That is a misunderstanding of what continuous delivery is. That somehow assumes that one can do CD without running tests, without building binaries, without making releases, and so on and so forth. It’s as if we can continuously deliver or deploy something without the steps often characterized as CI. So, we can choose to do CI, or CD, or both. That’s not the case. We can do only one. If we are doing CI, we are not doing CD. If we are doing CD, CI is included, so we do not do it as a separate practice.<\/p>\n<p>Confused?<\/p>\n<p>Continuous integration, delivery, and deployment all start from the same point. Those are all initiated by making a push to a code repository. The difference is only how far to the right the automated process goes. If it stops before generating a release that is deployable to production, it is continuous integration. If it does create such a release, but it does not deploy it to production, it is continuous delivery. If it does everything, including deployments to production, it is continuous deployment.<\/p>\n<p>So, if all the CI steps are available in CD, we can say that <strong>continuous integration is a subset of continuous delivery<\/strong>, which is a subset of continuous deployment. As such, there are no CD tools that are not capable of doing CI. However, the opposite is not true. There are indeed CI tools that are not capable of deploying to production.<\/p>\n<blockquote><p>I must stress out that many tools that are marketed as CD are not doing CD. Argo CD, for example, has CD in its name but is not a stand alone solution, it doesn’t handle testing or all sorts of other things needed for CD. It is in charge of deploying applications while, as I already explained, CD is about the full automation of the application lifecycle.<\/p><\/blockquote>\n<p>Now, most CI tools are capable of doing CD. Most are running some form of pipelines that allow us to automate steps in the application lifecycle. The essence of all of them is to provide orchestration of steps. Steps can be anything given that, if everything else fails, one can always execute a Shell script that, for example, does the deployment.<\/p>\n<p>What distinguishes some CI and CD tools from others is not which types of steps they can perform. Anything can be scripted, so any type of a step (including deployments) can be part of a tool that orchestrates automation. The differences are rather in how the tools work, whether they are scalable, how easy they are, how many helper functions they provide, how extensible there are, and so on, and so forth.<\/p>\n<p>I could argue that <a href=\"https:\/\/codefresh.io\/\">Codefresh<\/a> is the tool that is well suited for continuous delivery and, as such, for continuous integration as well. I could say that there are quite a few features that make it stand above the crowd and the best choice we have today. But I will not do that right now. That is reserved for the follow-up post.<\/p>\n<p>Until the next time, please <a href=\"https:\/\/codefresh.io\/codefresh-signup\/?utm_source=Blog&amp;utm_medium=Post&amp;utm_campaign=vfarcic-ci-cd\">Create A Free Codefresh Account<\/a> and see how you can take your CI or CD processes to the next level.<\/p>\n<input class=\"fooboxshare_post_id\" type=\"hidden\" value=\"17208\"\/>","protected":false},"excerpt":{"rendered":"<p>CI and CD tools are popular for a good reason. They help us automate the application lifecycle, fully or partially. However, the problem is that, in some cases, we are moving away from the core principles behind the CI and CD processes. Products on the market tend to “bend” the definitions of what CI and &hellip; <a href=\"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/\">Read more<\/a><\/p>\n","protected":false},"author":125,"featured_media":17656,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[3120,1543],"tags":[15,68,78,980,2243],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v17.9 (Yoast SEO v18.4.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>What the Heck Is Continuous Integration (CI), Delivery (CD), and Deployment (CDP)? | Codefresh<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"What the Heck Is Continuous Integration (CI), Delivery (CD), and Deployment (CDP)?\" \/>\n<meta property=\"og:description\" content=\"CI and CD tools are popular for a good reason. They help us automate the application lifecycle, fully or partially. However, the problem is that, in some cases, we are moving away from the core principles behind the CI and CD processes. Products on the market tend to “bend” the definitions of what CI and &hellip; Read more\" \/>\n<meta property=\"og:url\" content=\"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/\" \/>\n<meta property=\"og:site_name\" content=\"Codefresh\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/codefresh.io\" \/>\n<meta property=\"article:published_time\" content=\"2020-10-06T17:30:13+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-10-19T18:00:51+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/live-codefresh.pantheonsite.io\/wp-content\/uploads\/2020\/10\/Codefresh-Banners.png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@codefresh\" \/>\n<meta name=\"twitter:site\" content=\"@codefresh\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Contributor\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/codefresh.io\/#organization\",\"name\":\"Codefresh\",\"url\":\"https:\/\/codefresh.io\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/codefresh.io\",\"https:\/\/www.linkedin.com\/company\/codefresh\",\"https:\/\/www.youtube.com\/channel\/UC9r94SY6BqN05kXPIHsDXPg\",\"https:\/\/twitter.com\/codefresh\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/codefresh.io\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Codefresh_Logo_Vertical_LightBkgd.png\",\"contentUrl\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Codefresh_Logo_Vertical_LightBkgd.png\",\"width\":800,\"height\":800,\"caption\":\"Codefresh\"},\"image\":{\"@id\":\"https:\/\/codefresh.io\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/codefresh.io\/#website\",\"url\":\"https:\/\/codefresh.io\/\",\"name\":\"Codefresh\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/codefresh.io\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/codefresh.io\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#webpage\",\"url\":\"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/\",\"name\":\"What the Heck Is Continuous Integration (CI), Delivery (CD), and Deployment (CDP)? | Codefresh\",\"isPartOf\":{\"@id\":\"https:\/\/codefresh.io\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#primaryimage\"},\"datePublished\":\"2020-10-06T17:30:13+00:00\",\"dateModified\":\"2020-10-19T18:00:51+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/codefresh.io\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"What the Heck Is Continuous Integration (CI), Delivery (CD), and Deployment (CDP)?\"}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#webpage\"},\"author\":{\"@id\":\"https:\/\/codefresh.io\/#\/schema\/person\/268e5c2e4740502fae6d803783a16c75\"},\"headline\":\"What the Heck Is Continuous Integration (CI), Delivery (CD), and Deployment (CDP)?\",\"datePublished\":\"2020-10-06T17:30:13+00:00\",\"dateModified\":\"2020-10-19T18:00:51+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#webpage\"},\"wordCount\":2285,\"commentCount\":1,\"publisher\":{\"@id\":\"https:\/\/codefresh.io\/#organization\"},\"image\":{\"@id\":\"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2020\/10\/Codefresh-Banners.png\",\"keywords\":[\"continuous integration\",\"continuous delivery\",\"ci\",\"continuous deployment\",\"cd\"],\"articleSection\":[\"Continuous Deployment\/Delivery\",\"Continuous Integration\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#respond\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/codefresh.io\/#\/schema\/person\/268e5c2e4740502fae6d803783a16c75\",\"name\":\"Contributor\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/codefresh.io\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/26bd6dd87bf70f0c1a44721c8b3abbbd?s=96&d=blank&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/26bd6dd87bf70f0c1a44721c8b3abbbd?s=96&d=blank&r=g\",\"caption\":\"Contributor\"},\"url\":\"https:\/\/codefresh.io\/author\/contributor\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"What the Heck Is Continuous Integration (CI), Delivery (CD), and Deployment (CDP)? | Codefresh","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/","og_locale":"en_US","og_type":"article","og_title":"What the Heck Is Continuous Integration (CI), Delivery (CD), and Deployment (CDP)?","og_description":"CI and CD tools are popular for a good reason. They help us automate the application lifecycle, fully or partially. However, the problem is that, in some cases, we are moving away from the core principles behind the CI and CD processes. Products on the market tend to “bend” the definitions of what CI and &hellip; Read more","og_url":"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/","og_site_name":"Codefresh","article_publisher":"https:\/\/www.facebook.com\/codefresh.io","article_published_time":"2020-10-06T17:30:13+00:00","article_modified_time":"2020-10-19T18:00:51+00:00","og_image":[{"url":"https:\/\/live-codefresh.pantheonsite.io\/wp-content\/uploads\/2020\/10\/Codefresh-Banners.png"}],"twitter_card":"summary_large_image","twitter_creator":"@codefresh","twitter_site":"@codefresh","twitter_misc":{"Written by":"Contributor","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/codefresh.io\/#organization","name":"Codefresh","url":"https:\/\/codefresh.io\/","sameAs":["https:\/\/www.facebook.com\/codefresh.io","https:\/\/www.linkedin.com\/company\/codefresh","https:\/\/www.youtube.com\/channel\/UC9r94SY6BqN05kXPIHsDXPg","https:\/\/twitter.com\/codefresh"],"logo":{"@type":"ImageObject","@id":"https:\/\/codefresh.io\/#logo","inLanguage":"en-US","url":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Codefresh_Logo_Vertical_LightBkgd.png","contentUrl":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Codefresh_Logo_Vertical_LightBkgd.png","width":800,"height":800,"caption":"Codefresh"},"image":{"@id":"https:\/\/codefresh.io\/#logo"}},{"@type":"WebSite","@id":"https:\/\/codefresh.io\/#website","url":"https:\/\/codefresh.io\/","name":"Codefresh","description":"","publisher":{"@id":"https:\/\/codefresh.io\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/codefresh.io\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#primaryimage","inLanguage":"en-US","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#webpage","url":"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/","name":"What the Heck Is Continuous Integration (CI), Delivery (CD), and Deployment (CDP)? | Codefresh","isPartOf":{"@id":"https:\/\/codefresh.io\/#website"},"primaryImageOfPage":{"@id":"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#primaryimage"},"datePublished":"2020-10-06T17:30:13+00:00","dateModified":"2020-10-19T18:00:51+00:00","breadcrumb":{"@id":"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/codefresh.io\/"},{"@type":"ListItem","position":2,"name":"What the Heck Is Continuous Integration (CI), Delivery (CD), and Deployment (CDP)?"}]},{"@type":"Article","@id":"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#article","isPartOf":{"@id":"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#webpage"},"author":{"@id":"https:\/\/codefresh.io\/#\/schema\/person\/268e5c2e4740502fae6d803783a16c75"},"headline":"What the Heck Is Continuous Integration (CI), Delivery (CD), and Deployment (CDP)?","datePublished":"2020-10-06T17:30:13+00:00","dateModified":"2020-10-19T18:00:51+00:00","mainEntityOfPage":{"@id":"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#webpage"},"wordCount":2285,"commentCount":1,"publisher":{"@id":"https:\/\/codefresh.io\/#organization"},"image":{"@id":"https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#primaryimage"},"thumbnailUrl":"https:\/\/codefresh.io\/wp-content\/uploads\/2020\/10\/Codefresh-Banners.png","keywords":["continuous integration","continuous delivery","ci","continuous deployment","cd"],"articleSection":["Continuous Deployment\/Delivery","Continuous Integration"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/codefresh.io\/continuous-deployment\/heck-continuous-integration-ci-delivery-cd-deployment-cdp\/#respond"]}]},{"@type":"Person","@id":"https:\/\/codefresh.io\/#\/schema\/person\/268e5c2e4740502fae6d803783a16c75","name":"Contributor","image":{"@type":"ImageObject","@id":"https:\/\/codefresh.io\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/26bd6dd87bf70f0c1a44721c8b3abbbd?s=96&d=blank&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/26bd6dd87bf70f0c1a44721c8b3abbbd?s=96&d=blank&r=g","caption":"Contributor"},"url":"https:\/\/codefresh.io\/author\/contributor\/"}]}},"acf":[],"_links":{"self":[{"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/posts\/17208"}],"collection":[{"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/users\/125"}],"replies":[{"embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/comments?post=17208"}],"version-history":[{"count":0,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/posts\/17208\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/media\/17656"}],"wp:attachment":[{"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/media?parent=17208"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/categories?post=17208"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/tags?post=17208"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}