{"id":20117,"date":"2021-09-13T11:45:33","date_gmt":"2021-09-13T11:45:33","guid":{"rendered":"https:\/\/codefresh.io\/?p=20117"},"modified":"2022-01-06T15:52:41","modified_gmt":"2022-01-06T15:52:41","slug":"simplify-kubernetes-helm-deployments","status":"publish","type":"post","link":"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/","title":{"rendered":"How to Simplify Your Kubernetes Helm Deployments"},"content":{"rendered":"<p>Is your Helm chart promotion process complicated and difficult to automate? Are rapidly increasing Helm chart versions making your head spin? Do you wish you had a way to quickly and easily see the differences between deployments across all of your environments?<\/p>\n<p>If you answered “yes” to any of these questions, then read on! My purpose for writing this article is to share a few of the techniques that I’ve seen make the biggest impact for Codefresh and our customers. That said, if what you’re looking for is a more comprehensive list of Helm best practices, then we’ve got you covered over <a href=\"https:\/\/codefresh.io\/docs\/docs\/new-helm\/helm-best-practices\/\">in our documentation<\/a>.<\/p>\n<p>I’ve been lucky to see a lot of great ideas and approaches regarding Helm, so in order to choose the ones I think are most impactful, I’ll start by defining what I think success looks like.<\/p>\n<p>My goals for simpler Helm deployments and promotions are to be able to:<\/p>\n<ul>\n<li>Easily find and look at any chart version<\/li>\n<li>Minimize my Helm chart version sprawl<\/li>\n<li>Easily compare the differences between deployments across all my environments (test, QA, staging, production, etc.)<\/li>\n<li>Easily automate promotions from one environment to another<\/li>\n<\/ul>\n<p>Of course, your definition of “simpler” may differ from mine, which is why this isn’t really a “best practices” article. I’m just presenting some cool ideas, which you can take or leave depending on whether or not you find them helpful in your particular situation. Let’s take it one goal at a time, starting with…<\/p>\n<h2>Easily find any chart version<\/h2>\n<p>If you’re deploying charts directly from a Git repository, then you know that while it’s easy to look at the HEAD of your repo\/branch to examine a currently-deployed chart, examining older versions of that chart is not so easy. I’m referring to the tedious task of sifting through one’s Git history, one commit at a time, trying to find a specific chart version. UGH &#8211; this is never a good time!<\/p>\n<p>One way that I’ve seen folks attempt to make this scenario more workable is to put the Helm chart version in their commit message. I’ve found this method unreliable in practice, and searching for a specific chart version requires a lot of cryptic grepping and git log commands. A similar approach is to tag one’s Git commits with the Helm chart version. This is still rather cryptic to deal with, and it creates an additional problem with tag sprawl.<\/p>\n<p>Furthermore, there are other problems beyond just searching for chart versions. When deploying charts from Git to multiple environments, a common approach is to create a long-lived branch for each environment. In this scenario, when I promote a chart from one environment to another, I’m essentially copying the chart from one branch to another, usually with a Pull Request. This means that I now have 2 copies of the same chart. Not only are we placing a lot of trust in my Pull Request to ensure that I’ve captured every single file from the chart version I’m promoting, but we’ve also lost our single source of truth for this version: placing it into 2 different long-lived branches introduces the possibility of divergence.<\/p>\n<p>In short, managing chart versions in Git alone is painful. And it’s for this reason that Codefresh recommends&#8230;<\/p>\n<h2>Technique #1: Use a Helm Chart Repository<\/h2>\n<p>Storing your Helm charts as packages in a repo makes it way easier to find whichever version(s) you’re looking for. For example, if I have a Helm chart called “buslog”, I can quickly search for all available versions:<\/p>\n<pre>helm search repo buslog\n<\/pre>\n<p>Then I can pull the specific version that I want to examine:<\/p>\n<pre>helm pull myrepo\/buslog --version 1.3.16\n<\/pre>\n<p>Don’t get me wrong &#8211; we should still develop and update our Charts in Git. I’m just saying that whenever we update the chart and increment its version, we should push it as a package to a Helm chart repository (via a CI pipeline) where it can be easily searched and used\/reused for deployments. Furthermore, we are now free to place our charts wherever we like in Git &#8211; they don’t necessarily need to be tied to the Git repository we use for deployments any more.<br \/>\nSpeaking of deployments, let’s take a moment to talk about 3 mechanisms that you can use to deploy your Helm chart repository-based packages from your CD.<\/p>\n<ul>\n<li><a href=\"https:\/\/github.com\/roboll\/helmfile#getting-started\">Helmfile tool<\/a> &#8211; lets you deploy a helmfile.yaml list of charts, including the specific version and repository where each chart lives. You can also have one helmfile.yaml per environment\/branch, and since their charts all refer back to the same repository, our single source of truth is maintained. Simply call the helmfile binary from your CD pipeline to apply a helmfile.yaml file.<\/li>\n<li><a href=\"https:\/\/argoproj.github.io\/argo-cd\/operator-manual\/declarative-setup\/\">Argo CD application spec<\/a> &#8211; if you’re using <a href=\"https:\/\/codefresh.io\/argo-cd-gitops\/\">Argo CD<\/a>, then one option is to simply update your application specs to point to charts in a Helm chart repository instead of a Git repository. As with Helmfile, we can have Argo CD applications that deploy charts to lots of different environments, and since they all refer to the same Helm chart repo, we get our single source of truth. Here are the fields you’ll need to update in your application specs:<\/li>\n<\/ul>\n<pre>spec:\n  source:\n    chart: buslog   # the chart attribute replaces the path attribute\n    targetRevision: 1.3.16\n    repoURL: https:\/\/h.cfcr.io\/codefreshdemo\/public\n<\/pre>\n<ul>\n<li>Helm Umbrella Chart &#8211; This mechanism is really flexible. You can use it to deploy a single chart, or a group of related charts. You can use it in conjunction with a Helmfile or an Argo CD application to group related charts together, or you can just deploy it by itself from a basic CD pipeline with the helm command. Umbrella charts also have some advanced features which we’ll talk about later in this article. Here is an example:<\/li>\n<\/ul>\n<pre>apiVersion: v2  # v2 = Helm3\nname: test-environment\ntype: application\nversion: 0.1.19\ndependencies:\n  - name: buslog\n    version: 1.3.16\n    repository: https:\/\/h.cfcr.io\/codefreshdemo\/public\n<\/pre>\n<p>And one final note on Helm chart repositories… One of the barriers to adopting a repository in Helm 2 was that it typically required one to manage an additional application or VM in which to house this repository. Now with Helm 3, you can use any OCI-based container registry as your Helm chart repository. This includes most of the major Docker registries that you’re probably already using, like Amazon ECR, Google Artifact Registry, Azure ACR, Harbor, Artifactory, etc.<\/p>\n<p>Let’s move on to our next goal&#8230;<\/p>\n<h2>Minimize Helm chart version sprawl<\/h2>\n<p>I know there are lots of different chart versioning strategies out there (some of which use the <a href=\"https:\/\/codefresh.io\/docs\/docs\/new-helm\/helm-best-practices\/#chart-versions-and-appversions\">appVersion <\/a>field, which I don’t really discuss here), so this goal may or may not resonate with you. That said, one very common versioning strategy is to increment a chart’s version every time it gets a new Docker image. Since new Docker images tend to get built for every application commit, then this could very well mean that you’re also generating a new chart version for every commit. And if we’re versioning on every commit, then the versions have lost not only their meaning, but also their usefulness.<\/p>\n<p>One way to bring meaning back to chart versioning is to only version a chart when it’s structure changes (i.e. the Chart.yaml, values.yaml, or templates), and not for each time its image changes. “But wait,” you say, “when I change my image, won’t I at the very least need to change the chart’s values.yaml??” Well, not necessarily. And this brings us to our next technique…<\/p>\n<h2>Technique #2: Use Umbrella Charts<\/h2>\n<p>Helm charts have the ability to include other charts, referred to as subcharts, via their <a href=\"https:\/\/helm.sh\/docs\/helm\/helm_dependency\/\">dependencies <\/a>section. When a chart is created for the purpose of grouping together related subcharts\/services, such as to compose a whole application or deployment, we call this an <strong>umbrella chart<\/strong>.<\/p>\n<p>When using an umbrella chart, it is really easy to <a href=\"https:\/\/helm.sh\/docs\/chart_template_guide\/subcharts_and_globals\/#overriding-values-from-a-parent-chart\">override values<\/a> in its subcharts, such as the tag of a new image. We do this in the umbrella chart’s values.yaml, by placing the new value at <code>&lt;name-of-subchart&gt;.path.to.image.tag<\/code>. For example, to override the <code>image.tag<\/code> value in the buslog subchart our previous umbrella chart example, we would place this set of attributes into the umbrella chart’s <code>values.yaml<\/code>:<\/p>\n<pre>buslog:\n  image:\n    tag: featureXYZ-4a28596\n<\/pre>\n<p>So the idea here is that you would have an umbrella chart in the Git repo\/branch that you use for deploying one or more services (usually a group of related services) to an environment. Then for most changes, your CI or promotion pipeline is just going to update one line in this umbrella chart’s values.yaml, and it will leave the subchart (buslog in this example) completely alone. Your subchart would only need to have its chart version incremented on those rare occasions when its non-image elements change (usually as part of a CI pipeline).<\/p>\n<p>In this scenario, you may feel that it makes sense to update the version of the umbrella chart, since we are changing its values.yaml with the subchart’s new image. If so, then that’s OK &#8211; we’ve still massively reduced the amount of frivolous version updates in all of our subcharts, which is a big improvement. And if not, then that’s OK too &#8211; I haven’t found very many scenarios in which I’ve been able to derive value from versioning umbrella charts that represent the deployment of a whole environment. One exception to that might be if you wanted to deploy duplicate environments. In that case, versioning the umbrella chart (and maybe also storing it in a Helm chart repo) could be very useful.<\/p>\n<p>At this point, I think a visual aid might help illustrate how this all comes together. Here is a build from an example CI pipeline for a microservice, which processes both its Helm chart and its Docker image.<\/p>\n<figure id=\"attachment_20120\" aria-describedby=\"caption-attachment-20120\" style=\"width: 1999px\" class=\"wp-caption alignnone\"><a href=\"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image2-1.png\"><img class=\"size-full wp-image-20120\" src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image2-1.png\" alt=\"Microservice pipeline\" width=\"1999\" height=\"851\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image2-1.png 1999w, https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image2-1-300x128.png 300w, https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image2-1-1024x436.png 1024w, https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image2-1-768x327.png 768w, https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image2-1-1536x654.png 1536w, https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image2-1-20x9.png 20w\" sizes=\"(max-width: 1999px) 100vw, 1999px\" \/><\/a><figcaption id=\"caption-attachment-20120\" class=\"wp-caption-text\">Microservice pipeline<\/figcaption><\/figure>\n<p>In the PREP stage, you can see that there is a Detect Changes step, which checks to see if any of the Helm chart’s files have changed. You can check for this with a git show command, similar to:<\/p>\n<pre>git show --name-only --oneline | grep \"$DIRECTORY_OF_CHART\" \\\n    &amp;&amp; export CHART_CHANGED=true || export CHART_CHANGED=false\n\n<\/pre>\n<p>If the chart’s files have not changed (as will be the case most of the time), you can see that the entire PUSH CHART TO REPO stage is greyed out, indicating that it is skipped. Then you can see that the pipeline moves on to build the new Docker image. Finally, in the PROMOTE TO TEST stage, it updates the umbrella chart for the Test environment with the new image tag. Afterwards, our CD process should pick up the updated umbrella chart, and deploy it to Test. You can view the whole pipeline YAML for this example in <a href=\"https:\/\/github.com\/codefresh-contrib\/example-multiservice-deploy\/blob\/main\/.codefresh\/ci-steps.yaml\">GitHub<\/a>.<\/p>\n<p>If you’re a fan of Helmfile, you may be thinking at this point that you can achieve all the things I’ve just described with Helmfile as well. And you’d be right! Helmfile is a solid tool. However, I’m recommending umbrella charts here because of their excellent compatibility with other tools. Right now the <a href=\"https:\/\/codefresh.io\/gitops\/\">GitOps movement<\/a> is gaining a ton of momentum and industry focus\/development. The major GitOps sync tools like <a href=\"https:\/\/codefresh.io\/argo-cd-gitops\/\">Argo CD<\/a> (to which Codefresh contributes) and Flux CD are not compatible with Helmfile. If you’re already an Argo CD user, then you can easily point your Argo CD applications at Git deployment repos containing umbrella charts. Your CI and promotion pipelines can concentrate their changes on the umbrella charts, and shouldn’t ever need to touch the Argo CD application specs.<\/p>\n<p>Now on to the next goal&#8230;<\/p>\n<h2>Easily compare differences between environments<\/h2>\n<p>If we use an umbrella chart and Helm chart repo to specify the whole deployment for each of our environments, then we can shrink the number of files to compare per environment down to 2: Chart.yaml and values.yaml. Not bad, eh!? If we’re using a separate Git branch for each of our deployment environments, then we can use <code>git diff<\/code> to compare these 2 files between branches\/environments. Now in my opinion, keeping environments separated into branches like this is still kind of a pain, which takes me to the next technique&#8230;<\/p>\n<h2>Technique #3: Use a deployment monorepo<\/h2>\n<p>Many of us have spent years working with various Git branching strategies that have encouraged us to create a separate branch for each deployment environment. So when we transitioned into doing CD for microservices, it seemed only natural to keep using branches for environments. But for most deployment repositories, separating environments into branches has very little value. Most of the time, it just adds restrictions, like needing to use <code>git diff<\/code> for comparisons, as mentioned above. Instead, it would be a lot more straightforward if we used subdirectories for each environment, thus creating a sort of monorepo for deployments.<\/p>\n<p>For example, here is what one of my Git deployment repos with subdirectories looks like:<\/p>\n<figure id=\"attachment_20123\" aria-describedby=\"caption-attachment-20123\" style=\"width: 536px\" class=\"wp-caption alignnone\"><a href=\"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image1-1.png\"><img class=\"size-full wp-image-20123\" src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image1-1.png\" alt=\"Monorepo\" width=\"536\" height=\"474\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image1-1.png 536w, https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image1-1-300x265.png 300w, https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image1-1-20x18.png 20w\" sizes=\"(max-width: 536px) 100vw, 536px\" \/><\/a><figcaption id=\"caption-attachment-20123\" class=\"wp-caption-text\">Monorepo<\/figcaption><\/figure>\n<p>You can see that I have directories for 4 environments: test, qa, stage, and prod. And because I don’t have to traverse different Git branches to see everything, the task of comparing and manipulating these files is a lot easier. For example, I can now look at all my environments in my Git system’s web UI, or compare them with any standard text editor. It took me about 10 seconds to compare my Test and QA environments from my trusty VS Code window (below), and no esoteric Git or VS Code knowledge was required!<\/p>\n<figure id=\"attachment_20124\" aria-describedby=\"caption-attachment-20124\" style=\"width: 1994px\" class=\"wp-caption alignnone\"><a href=\"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image5.png\"><img class=\"size-full wp-image-20124\" src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image5.png\" alt=\"Diff between environments\" width=\"1994\" height=\"1232\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image5.png 1994w, https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image5-300x185.png 300w, https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image5-1024x633.png 1024w, https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image5-768x475.png 768w, https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image5-1536x949.png 1536w, https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image5-20x12.png 20w\" sizes=\"(max-width: 1994px) 100vw, 1994px\" \/><\/a><figcaption id=\"caption-attachment-20124\" class=\"wp-caption-text\">Diff between environments<\/figcaption><\/figure>\n<p>As you can see, I have 1 chart version and 3 image tags that are different between my environments.<br \/>\nOr if I fancy diff, I can use that just as easily. I love options!<\/p>\n<figure id=\"attachment_20125\" aria-describedby=\"caption-attachment-20125\" style=\"width: 1512px\" class=\"wp-caption alignnone\"><a href=\"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image4.png\"><img class=\"size-full wp-image-20125\" src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image4.png\" alt=\"Command line diff\" width=\"1512\" height=\"894\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image4.png 1512w, https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image4-300x177.png 300w, https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image4-1024x605.png 1024w, https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image4-768x454.png 768w, https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/image4-20x12.png 20w\" sizes=\"(max-width: 1512px) 100vw, 1512px\" \/><\/a><figcaption id=\"caption-attachment-20125\" class=\"wp-caption-text\">Command line diff<\/figcaption><\/figure>\n<p>Using a Git deployment repo with subdirectories for environments also helps us accomplish the final goal of this article&#8230;<\/p>\n<h2>Easily automate promotions from one environment to another<\/h2>\n<p>Since all of our environments are easily readable \/ updateable without having to change branches, the process of promoting an image or chart from one environment to the next is super simple. We can do this with just 2 lines of shell code, using the <a href=\"https:\/\/github.com\/mikefarah\/yq\">excellent yq v4 tool<\/a>. For example, to promote my buslog image from Test to QA:<\/p>\n<pre># Copy image tag from the source environment (test)\nIMAGE_TO_PROMOTE=$(yq eval .buslog.image.tag test\/values.yaml)\n\n# Paste image tag into the destination environment (qa)\nyq eval --inplace .buslog.image.tag=\\\"$IMAGE_TO_PROMOTE\\\" qa\/values.yaml\n\n<\/pre>\n<p>And since the promotion process is now simplified, it’s also really straightforward to automate it via a pipeline in your CI\/CD tool of choice &#8211; hopefully Codefresh! In which case, you could simply use the <a href=\"https:\/\/codefresh.io\/steps\/step\/helm-promote\">helm-promote step<\/a> from our Step Marketplace. While you’re at it, you might also want to gate your promotion pipeline <a href=\"https:\/\/codefresh.io\/steps\/step\/pending-approval\">with an approval step<\/a>, or have it <a href=\"https:\/\/codefresh.io\/steps\/step\/github-pr\">generate a Pull Request<\/a>.<\/p>\n<h2>Summary<\/h2>\n<p>In conclusion, we looked at 3 different techniques to help us simply our Helm deployments:<\/p>\n<ol>\n<li>Use a Helm Chart Repository<\/li>\n<li>Use Umbrella Charts<\/li>\n<li>Use a Deployment Monorepo<\/li>\n<\/ol>\n<p>Taken individually, they each provide value, and help us solve some of the goals presented at the beginning of this article. Taken together, however, I think these techniques can have a synergistic effect on one another, and can go a long way toward simplifying one’s Helm deployments. I hope you’ve been able to find at least one of them, if not all 3, useful in your situation!<\/p>\n<p>Happy automating!<\/p>\n<p>New to Codefresh? <a href=\"https:\/\/codefresh.io\/codefresh-signup\/?utm_source=Blog&amp;utm_medium=Post&amp;utm_campaign=simplifyhelm\">Create your free account today<\/a>!<\/p>\n<input class=\"fooboxshare_post_id\" type=\"hidden\" value=\"20117\"\/>","protected":false},"excerpt":{"rendered":"<p>Is your Helm chart promotion process complicated and difficult to automate? Are rapidly increasing Helm chart versions making your head spin? Do you wish you had a way to quickly and easily see the differences between deployments across all of your environments? If you answered “yes” to any of these questions, then read on! My &hellip; <a href=\"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/\">Read more<\/a><\/p>\n","protected":false},"author":93,"featured_media":20118,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2367,3120,5467,1657,1505,1538,6],"tags":[24,44,52,53,59,68,994],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v17.9 (Yoast SEO v18.4.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Simplify Your Kubernetes Helm Deployments<\/title>\n<meta name=\"description\" content=\"In this blog you will learn 3 techniques that will simplify your Kubernetes Helm deployments: Chart Repository, Umbrella Charts and deployment monorepo.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Simplify Your Kubernetes Helm Deployments\" \/>\n<meta property=\"og:description\" content=\"In this blog you will learn 3 techniques that will simplify your Kubernetes Helm deployments: Chart Repository, Umbrella Charts and deployment monorepo.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/\" \/>\n<meta property=\"og:site_name\" content=\"Codefresh\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/codefresh.io\" \/>\n<meta property=\"article:published_time\" content=\"2021-09-13T11:45:33+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-06T15:52:41+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/Simplifying-Helm.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"340\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@codefresh\" \/>\n<meta name=\"twitter:site\" content=\"@codefresh\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Ted Spinks\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/codefresh.io\/#organization\",\"name\":\"Codefresh\",\"url\":\"https:\/\/codefresh.io\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/codefresh.io\",\"https:\/\/www.linkedin.com\/company\/codefresh\",\"https:\/\/www.youtube.com\/channel\/UC9r94SY6BqN05kXPIHsDXPg\",\"https:\/\/twitter.com\/codefresh\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/codefresh.io\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Codefresh_Logo_Vertical_LightBkgd.png\",\"contentUrl\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Codefresh_Logo_Vertical_LightBkgd.png\",\"width\":800,\"height\":800,\"caption\":\"Codefresh\"},\"image\":{\"@id\":\"https:\/\/codefresh.io\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/codefresh.io\/#website\",\"url\":\"https:\/\/codefresh.io\/\",\"name\":\"Codefresh\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/codefresh.io\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/codefresh.io\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/Simplifying-Helm.png\",\"contentUrl\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/Simplifying-Helm.png\",\"width\":1024,\"height\":340},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#webpage\",\"url\":\"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/\",\"name\":\"How to Simplify Your Kubernetes Helm Deployments\",\"isPartOf\":{\"@id\":\"https:\/\/codefresh.io\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#primaryimage\"},\"datePublished\":\"2021-09-13T11:45:33+00:00\",\"dateModified\":\"2022-01-06T15:52:41+00:00\",\"description\":\"In this blog you will learn 3 techniques that will simplify your Kubernetes Helm deployments: Chart Repository, Umbrella Charts and deployment monorepo.\",\"breadcrumb\":{\"@id\":\"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/codefresh.io\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How to Simplify Your Kubernetes Helm Deployments\"}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#webpage\"},\"author\":{\"@id\":\"https:\/\/codefresh.io\/#\/schema\/person\/ae174f0651c1ef30c23e7209de3a9968\"},\"headline\":\"How to Simplify Your Kubernetes Helm Deployments\",\"datePublished\":\"2021-09-13T11:45:33+00:00\",\"dateModified\":\"2022-01-06T15:52:41+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#webpage\"},\"wordCount\":2539,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/codefresh.io\/#organization\"},\"image\":{\"@id\":\"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/Simplifying-Helm.png\",\"keywords\":[\"Containers\",\"Kubernetes\",\"devops\",\"CI\/CD\",\"codefresh\",\"continuous delivery\",\"helm\"],\"articleSection\":[\"Helm Tutorials\",\"Continuous Deployment\/Delivery\",\"Devops\",\"Kubernetes Tutorials\",\"Containers\",\"DevOps Tutorials\",\"How Tos\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#respond\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/codefresh.io\/#\/schema\/person\/ae174f0651c1ef30c23e7209de3a9968\",\"name\":\"Ted Spinks\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/codefresh.io\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/702f043f00b77f71ae58a18b11daaef3?s=96&d=blank&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/702f043f00b77f71ae58a18b11daaef3?s=96&d=blank&r=g\",\"caption\":\"Ted Spinks\"},\"description\":\"Ted Spinks is a Senior Solutions Architect at Codefresh. He is huge fan of DevOps automation. He loves writing code, diving into new APIs, and solving automation challenges. Before Codefresh, Ted worked as a CI\/CD engineer for an autonomous driving software company, Zenuity, and as a consultant at AHEAD and VMware.\",\"url\":\"https:\/\/codefresh.io\/author\/ted-spinks\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"How to Simplify Your Kubernetes Helm Deployments","description":"In this blog you will learn 3 techniques that will simplify your Kubernetes Helm deployments: Chart Repository, Umbrella Charts and deployment monorepo.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/","og_locale":"en_US","og_type":"article","og_title":"How to Simplify Your Kubernetes Helm Deployments","og_description":"In this blog you will learn 3 techniques that will simplify your Kubernetes Helm deployments: Chart Repository, Umbrella Charts and deployment monorepo.","og_url":"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/","og_site_name":"Codefresh","article_publisher":"https:\/\/www.facebook.com\/codefresh.io","article_published_time":"2021-09-13T11:45:33+00:00","article_modified_time":"2022-01-06T15:52:41+00:00","og_image":[{"width":1024,"height":340,"url":"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/Simplifying-Helm.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_creator":"@codefresh","twitter_site":"@codefresh","twitter_misc":{"Written by":"Ted Spinks","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/codefresh.io\/#organization","name":"Codefresh","url":"https:\/\/codefresh.io\/","sameAs":["https:\/\/www.facebook.com\/codefresh.io","https:\/\/www.linkedin.com\/company\/codefresh","https:\/\/www.youtube.com\/channel\/UC9r94SY6BqN05kXPIHsDXPg","https:\/\/twitter.com\/codefresh"],"logo":{"@type":"ImageObject","@id":"https:\/\/codefresh.io\/#logo","inLanguage":"en-US","url":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Codefresh_Logo_Vertical_LightBkgd.png","contentUrl":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Codefresh_Logo_Vertical_LightBkgd.png","width":800,"height":800,"caption":"Codefresh"},"image":{"@id":"https:\/\/codefresh.io\/#logo"}},{"@type":"WebSite","@id":"https:\/\/codefresh.io\/#website","url":"https:\/\/codefresh.io\/","name":"Codefresh","description":"","publisher":{"@id":"https:\/\/codefresh.io\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/codefresh.io\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#primaryimage","inLanguage":"en-US","url":"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/Simplifying-Helm.png","contentUrl":"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/Simplifying-Helm.png","width":1024,"height":340},{"@type":"WebPage","@id":"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#webpage","url":"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/","name":"How to Simplify Your Kubernetes Helm Deployments","isPartOf":{"@id":"https:\/\/codefresh.io\/#website"},"primaryImageOfPage":{"@id":"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#primaryimage"},"datePublished":"2021-09-13T11:45:33+00:00","dateModified":"2022-01-06T15:52:41+00:00","description":"In this blog you will learn 3 techniques that will simplify your Kubernetes Helm deployments: Chart Repository, Umbrella Charts and deployment monorepo.","breadcrumb":{"@id":"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/codefresh.io\/"},{"@type":"ListItem","position":2,"name":"How to Simplify Your Kubernetes Helm Deployments"}]},{"@type":"Article","@id":"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#article","isPartOf":{"@id":"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#webpage"},"author":{"@id":"https:\/\/codefresh.io\/#\/schema\/person\/ae174f0651c1ef30c23e7209de3a9968"},"headline":"How to Simplify Your Kubernetes Helm Deployments","datePublished":"2021-09-13T11:45:33+00:00","dateModified":"2022-01-06T15:52:41+00:00","mainEntityOfPage":{"@id":"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#webpage"},"wordCount":2539,"commentCount":0,"publisher":{"@id":"https:\/\/codefresh.io\/#organization"},"image":{"@id":"https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#primaryimage"},"thumbnailUrl":"https:\/\/codefresh.io\/wp-content\/uploads\/2021\/09\/Simplifying-Helm.png","keywords":["Containers","Kubernetes","devops","CI\/CD","codefresh","continuous delivery","helm"],"articleSection":["Helm Tutorials","Continuous Deployment\/Delivery","Devops","Kubernetes Tutorials","Containers","DevOps Tutorials","How Tos"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/codefresh.io\/helm-tutorial\/simplify-kubernetes-helm-deployments\/#respond"]}]},{"@type":"Person","@id":"https:\/\/codefresh.io\/#\/schema\/person\/ae174f0651c1ef30c23e7209de3a9968","name":"Ted Spinks","image":{"@type":"ImageObject","@id":"https:\/\/codefresh.io\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/702f043f00b77f71ae58a18b11daaef3?s=96&d=blank&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/702f043f00b77f71ae58a18b11daaef3?s=96&d=blank&r=g","caption":"Ted Spinks"},"description":"Ted Spinks is a Senior Solutions Architect at Codefresh. He is huge fan of DevOps automation. He loves writing code, diving into new APIs, and solving automation challenges. Before Codefresh, Ted worked as a CI\/CD engineer for an autonomous driving software company, Zenuity, and as a consultant at AHEAD and VMware.","url":"https:\/\/codefresh.io\/author\/ted-spinks\/"}]}},"acf":[],"_links":{"self":[{"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/posts\/20117"}],"collection":[{"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/users\/93"}],"replies":[{"embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/comments?post=20117"}],"version-history":[{"count":1,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/posts\/20117\/revisions"}],"predecessor-version":[{"id":20946,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/posts\/20117\/revisions\/20946"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/media\/20118"}],"wp:attachment":[{"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/media?parent=20117"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/categories?post=20117"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/tags?post=20117"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}