{"id":21180,"date":"2022-02-01T07:00:41","date_gmt":"2022-02-01T07:00:41","guid":{"rendered":"https:\/\/codefresh.io\/?p=21180"},"modified":"2022-02-04T00:08:07","modified_gmt":"2022-02-04T00:08:07","slug":"introducing-codefresh-software-delivery-platform-powered-argo","status":"publish","type":"post","link":"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/","title":{"rendered":"Introducing Codefresh Software Delivery Platform, Powered by Argo"},"content":{"rendered":"<p><em>This blog post was co-authored by Moran Goldboim, VP of Product at Codefresh.<\/em><\/p>\n<!--[if lt IE 9]><script>document.createElement('audio');<\/script><![endif]-->\n<audio class=\"wp-audio-shortcode\" id=\"audio-21180-1\" preload=\"none\" style=\"width: 100%;\" controls=\"controls\"><source type=\"audio\/mpeg\" src=\"https:\/\/res.cloudinary.com\/codefresh\/video\/upload\/v1643928847\/mktg\/audio\/introducing-codefresh-software-delivery-platform-powered-by-argo-read-by-dan-garfield_r47jhv.mp3?_=1\" \/><a href=\"https:\/\/res.cloudinary.com\/codefresh\/video\/upload\/v1643928847\/mktg\/audio\/introducing-codefresh-software-delivery-platform-powered-by-argo-read-by-dan-garfield_r47jhv.mp3\">https:\/\/res.cloudinary.com\/codefresh\/video\/upload\/v1643928847\/mktg\/audio\/introducing-codefresh-software-delivery-platform-powered-by-argo-read-by-dan-garfield_r47jhv.mp3<\/a><\/audio>\n<p><!--\/\/--><\/p>\n<p>Delivering new software is the single most important function of businesses trying to compete today. Many companies get stuck with flaky scripting, manual interventions, complex processes, and large unreliable tool stacks across diverse infrastructure. Software teams are left scrambling to understand their software supply chain and discover the root cause of failures. It’s time for a new approach.<\/p>\n<p>Today, we’re launching the Codefresh Software Delivery Platform (CSDP) to help you meet the software delivery challenge. The Codefresh platform is a complete software supply chain to build, test, deliver, and manage software with integrations so teams can pick best-of-breed tools to support that supply chain. Built on Argo, the world’s most popular and fastest-growing open source software delivery toolchain, the Codefresh Software Delivery Platform unlocks the full enterprise potential of Argo Workflows, Argo CD, Argo Events, and Argo Rollouts and provides a control-plane for managing them at scale.<\/p>\n<p>Let’s jump into the platform.<\/p>\n<h2>A Single-pane of Glass for the Entire Software Supply Chain<\/h2>\n<p>Deploying the platform onto a single Kubernetes cluster is simple, run one command to bootstrap CSDP and the entire configuration will also be written to git. The CSDP runtime includes the enterprise version of the entire Argo stack- with tools to simplify their operation and provide better traceability between them. By building on and integrating Argo Workflows and Events for running delivery pipelines, and Argo CD and Rollouts for GitOps deployments and progressive delivery we’re able to provide a stronger security model with a greatly simplified management that works at scale.<\/p>\n<p>Delivery Pipelines greatly simplify the creation and monitoring of workflows along with their triggers. These pipelines are optimized for DevOps flows such as CI\/CD pipelines for checking out code, building and testing artifacts, etc. They also work well for general purposes like data pipelines.<\/p>\n<p>Codefresh GitOps provides the application deployment layer. Defining an application is as simple as identifying a source repo and its target. Codefresh GitOps is built on Argo CD and Argo Rollouts to power progressive delivery.<\/p>\n<p><img class=\"aligncenter wp-image-21192 size-full\" src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Integrated-Argo-Dashboard.jpeg\" alt=\"\" width=\"960\" height=\"540\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Integrated-Argo-Dashboard.jpeg 960w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Integrated-Argo-Dashboard-300x169.jpeg 300w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Integrated-Argo-Dashboard-768x432.jpeg 768w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Integrated-Argo-Dashboard-20x11.jpeg 20w\" sizes=\"(max-width: 960px) 100vw, 960px\" \/><\/p>\n<p>More than these components, the platform seamlessly integrates with git, Jira, and others to provide a clear dashboard of all activity in the software supply chain. Bringing all these components into a single flow makes it easy to identify the cause of breaking changes, and keep track of all your running infrastructure and applications as changes flow into them. With easy remediation, teams have more confidence in deploying more frequently. Today, even high performant organizations often only deploy frequently on a few applications, CSDP enables companies to <em>deploy frequently for every application<\/em>.<\/p>\n<p>This also works at scale. Filtering all changes by deployment time, committer, application, Jira issue, or several other dimensions brings incredible traceability and clarity. The dashboard can even track all the locations a particular artifact is deployed across the entire organization.<\/p>\n<h2>Built On GitOps For Total Traceability And Reliable Management<\/h2>\n<p>GitOps is a revolution in software delivery and management that simplifies and makes accessible decades of best practices. With GitOps, the desired state of software must be stored in version control and the actual state must be constantly monitored for divergence and if need be, corrected. This is in sharp contrast to most software delivery operations today which are done by teams doing manual work and then (hopefully) documenting that work in git and is generally indifferent to the state of production.<\/p>\n<p>The Codefresh Software Delivery Platform is the only enterprise DevOps solution that operates completely with GitOps from the ground up. Using the CLI or GUI in CSDP generally ends with a git commit. Whether that’s installing the platform, creating a pipeline, or deploying new software. The CLI\/GUI simply acts as extended interfaces of version control. A change to the desired state of the software supply chain will automatically be applied to the actual state.<\/p>\n<p><img class=\"aligncenter wp-image-21201 size-full\" src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/gitops-explained.jpeg\" alt=\"\" width=\"960\" height=\"540\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/gitops-explained.jpeg 960w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/gitops-explained-300x169.jpeg 300w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/gitops-explained-768x432.jpeg 768w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/gitops-explained-20x11.jpeg 20w\" sizes=\"(max-width: 960px) 100vw, 960px\" \/><\/p>\n<p>In CSDP, every change and configuration goes directly into git. This makes git a common language for both engineering and operations and provides a full change history. Simplified change management, and permission management in the platform scope each user to their permissions in git and provide a full changelog for auditability of every change.<\/p>\n<h2>Unlocking the Full Potential of the Argo Project with Simplified Management that Works at Scale<\/h2>\n<p>The Argo Project is already the world’s fastest-growing, and most popular open-source project for delivering software. It’s no surprise that companies like Tesla, Google, Adobe, and others are using it with great success. For power users like these, CSDP releases the full potential of Argo. Correlating workflows with deployments, rollouts, commits, and more under a single unified user experience.<\/p>\n<p>Likewise, when deployed as a single platform Codefresh greatly simplifies the management and adoption of Argo. If you’ve already defined Argo workflows and events, they will work natively in Codefresh Software Delivery Platform.<\/p>\n<p>Codefresh acts as a control plane across all your instances. This is one of the greatest areas of value for teams using Argo today. Rather than many instances of Argo being operated separately and maintained individually, the control plane allows all instances to be monitored and managed in concert. Each instance comes with security and SSO baked in greatly simplifying the experience of running Argo in an enterprise environment. Upgrading runtimes is as simple as running a single command or making a git commit. This control plane works regardless of the runtime’s location, whether it’s on an edge cluster or in a virtual private cloud. All sensitive information is kept local to the runtime and is not shared with Codefresh.<\/p>\n<p><img class=\"aligncenter wp-image-21193 size-large\" src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/managing-argo-at-scale-1024x620.png\" alt=\"\" width=\"1024\" height=\"620\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/managing-argo-at-scale-1024x620.png 1024w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/managing-argo-at-scale-300x182.png 300w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/managing-argo-at-scale-768x465.png 768w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/managing-argo-at-scale-1536x930.png 1536w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/managing-argo-at-scale-20x12.png 20w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/managing-argo-at-scale.png 1999w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>The Codefresh platform provides the benefits of a fully-managed service with the security and flexibility of a self-managed offering.<\/p>\n<h2>Continuous Delivery and Progressive Delivery Made Easy<\/h2>\n<p>Those familiar with Argo CD and <a href=\"https:\/\/github.com\/argoproj-labs\/argocd-autopilot\">Argo CD Autopilot<\/a> will be pleased to see their configurations are fully compatible with the platform and can instantly gain value from Codefresh’s robust features. Those new to continuous delivery will find the setup straightforward and easy. The new unified UI brings the full value of Argo CD and Argo Rollouts into a single view so you no longer have to jump around between tools to understand what’s going on.<\/p>\n<p>Like the rest of the platform, Codefresh GitOps takes an opinionated but flexible approach to software delivery. To deploy an application, simply define the git source of manifests and set a deployment target. Doing this from the UI will commit the configuration to git. Once in git, Codefresh GitOps will automatically detect the application and deploy it.<\/p>\n<p><img class=\"aligncenter wp-image-21194 size-full\" src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/progressive-delivery-with-argo-rollouts.png\" alt=\"\" width=\"1999\" height=\"715\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/progressive-delivery-with-argo-rollouts.png 1999w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/progressive-delivery-with-argo-rollouts-300x107.png 300w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/progressive-delivery-with-argo-rollouts-1024x366.png 1024w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/progressive-delivery-with-argo-rollouts-768x275.png 768w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/progressive-delivery-with-argo-rollouts-1536x549.png 1536w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/progressive-delivery-with-argo-rollouts-20x7.png 20w\" sizes=\"(max-width: 1999px) 100vw, 1999px\" \/><\/p>\n<p><img class=\"wp-image-21195 size-medium alignleft\" src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/progressive-delivery-health-analysis-196x300.png\" alt=\"\" width=\"196\" height=\"300\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/progressive-delivery-health-analysis-196x300.png 196w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/progressive-delivery-health-analysis-13x20.png 13w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/progressive-delivery-health-analysis.png 638w\" sizes=\"(max-width: 196px) 100vw, 196px\" \/><img class=\"wp-image-21196 size-medium alignleft\" src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/canary-release-argo-rollouts-196x300.png\" alt=\"\" width=\"196\" height=\"300\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/canary-release-argo-rollouts-196x300.png 196w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/canary-release-argo-rollouts-13x20.png 13w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/canary-release-argo-rollouts.png 638w\" sizes=\"(max-width: 196px) 100vw, 196px\" \/><\/p>\n<p>Progressive delivery has long been out of reach for release teams because of complex requirements. In the Codefresh platform, progressive delivery strategies like canary or blue\/green can be simply defined in a declarative manner. Canary and blue\/green deployments can greatly reduce the risk of rolling out new changes by automatically detecting issues before they hit most users and rolling back to previous stable versions. In the screenshots above, we see canary releases along with the health checks monitoring their rollout.<\/p>\n<h2>Delivery Pipelines Are the BackBone of the Software Supply Chain<\/h2>\n<p>Ultimately every company is seeking to deploy software more frequently with greater confidence in avoiding breaking changes and improving the mean time to resolution. But teams can’t get to continuous delivery without first solving continuous integration.<\/p>\n<p>A Delivery Pipeline is the combination of a workflow along with the events that trigger it. We’ve added a pipeline creation wizard that will create all the component configurations so you can spend less time with YAML and more time getting work done. The pipeline creation wizard ends with committing the configuration to git and allowing the built-in Argo CD instance to deploy them to the relevant runtimes.<\/p>\n<p>The Delivery pipeline model also allows the creation of a single reusable pipeline that operates based on the context of its triggers. Pipelines can easily work as templates to be reused by thousands of different applications. DevOps teams can build once and use everywhere. Each step in a workflow operates in its own container and pod. This allows pipelines to take advantage of the distributed architecture of Kubernetes to easily scale both on the number of running workflows and within each workflow itself.<\/p>\n<p><img class=\"aligncenter wp-image-21197 size-full\" src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/argo-workflows-and-events-integration.png\" alt=\"\" width=\"960\" height=\"540\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/argo-workflows-and-events-integration.png 960w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/argo-workflows-and-events-integration-300x169.png 300w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/argo-workflows-and-events-integration-768x432.png 768w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/argo-workflows-and-events-integration-20x11.png 20w\" sizes=\"(max-width: 960px) 100vw, 960px\" \/><\/p>\n<p>Current Argo users will especially appreciate how much simpler it is to create DevOps pipelines because sensors and workflow creation are merged into a single flow. The visibility in CSDP also makes debugging issues with events and workflows much easier as they are associated and logs collected into the main view of each execution.<\/p>\n<p>To learn more about creating delivery pipelines, <a href=\"https:\/\/codefresh.io\/csdp-docs\/docs\/getting-started\/quick-start\/create-ci-pipeline\/\">check out the quickstart<\/a>.<\/p>\n<h2>Choose The Best Tool for the Job with Codefresh’s Approach to Extensibility<\/h2>\n<p>When choosing DevOps tools many teams are forced to pick between all-in-one platforms with immature features, or highly specific tools without integrations. With Codefresh the platform is designed to provide a powerful and functional software supply chain framework in which you can bring the best-of-breed tools to help you deliver software. One area where this is evident is in the Codefresh Hub for Argo: an open repository of integrations designed for Argo Workflows. <a href=\"https:\/\/codefresh.io\/argohub\/\">Codefresh Hub for Argo<\/a> is an important community resource with growing contributions from the community and verified and secure templates maintained by Codefresh and soon others.<\/p>\n<p><img class=\"aligncenter wp-image-21198 size-large\" src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/codefresh-hub-for-argo-workflow-templates-1024x485.png\" alt=\"\" width=\"1024\" height=\"485\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/codefresh-hub-for-argo-workflow-templates-1024x485.png 1024w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/codefresh-hub-for-argo-workflow-templates-300x142.png 300w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/codefresh-hub-for-argo-workflow-templates-768x364.png 768w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/codefresh-hub-for-argo-workflow-templates-1536x728.png 1536w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/codefresh-hub-for-argo-workflow-templates-20x9.png 20w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/codefresh-hub-for-argo-workflow-templates.png 1999w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>As a platform, Codefresh has 1st class integrations with Jira, Git-providers, security vendors, cloud providers, and many others. We don’t believe that Codefresh has to build the best of everything, we can build the best core and supply chain that allows users to pick the best-of-breed tools they want to use and bring them into a single flow. Adopting Codefresh doesn’t force teams to replace the components of software delivery that work well. Instead, it integrates and expands the capabilities into a single, easy-to-use supply chain.<\/p>\n<h2>Enterprise Security and Reliability<\/h2>\n<p>Codefresh uses a unique hybrid model. Codefresh hosts the control plane while runtimes are deployed on the infrastructure you control. Each runtime operates independently when needed but reports status and other relevant information to the control plane. If the control plane were to go down for some reason, each runtime will continue to operate with git as its source of truth.<\/p>\n<p>This model is in sharp contrast to traditional approaches that require teams to take on the burden of maintaining fully on-prem complex software stacks or put full trust in a hosted solution. These traditional approaches force teams to trade ease of use for security in a bargain no one really wants to make.<img class=\"aligncenter wp-image-21199 size-full\" src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/platform-architecture.png\" alt=\"\" width=\"960\" height=\"540\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/platform-architecture.png 960w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/platform-architecture-300x169.png 300w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/platform-architecture-768x432.png 768w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/platform-architecture-20x11.png 20w\" sizes=\"(max-width: 960px) 100vw, 960px\" \/><\/p>\n<p>A hybrid model is a fresh approach that provides security and ease of use. Hybrid means secrets, git access, and other relevant keys are stored on the infrastructure you control and the connection to the control plane in Codefresh doesn’t pass those secrets. This is how you can use Codefresh to build, run, and deploy code monitored from your dashboard in Codefresh without Codefresh ever having access to your code.<\/p>\n<p>We also partnered with Snyk to constantly monitor and scan the CSDP codebase and images.<\/p>\n<p>“We are excited to partner with Codefresh to help developers scale securely when building cloud applications,&#8221; said Jill Wilkins, Senior Director Global Alliances at Snyk, a leader in developer security. &#8220;When developers are empowered to work within their preferred environment, organizations are able to dramatically improve their security posture and preserve application development efficiencies.&#8221;<\/p>\n<h2>Available today<\/h2>\n<p>Teams that adopt Codefresh Software Delivery Platform deploy more often, with greater confidence, and are able to resolve issues in production much more quickly. This is because we unlock the full potential of Argo to create a single cohesive software supply chain. Argo users can bring their configurations and immediately bring clarity and simplified management that they didn’t have before. For users of traditional CI\/CD tooling, the fresh approach to software delivery is dramatically easier to adopt, more scalable, and much easier to manage with the unique hybrid model.<\/p>\n<p>Starting today with additional features rolling out over the coming weeks, CSDP is available free for small teams and with a free trial for larger teams. Get started at <a href=\"https:\/\/codefresh.io\/codefresh-signup\/\">https:\/\/codefresh.io\/codefresh-signup\/ <\/a><\/p>\n<h3>Read more about Codefresh Software Delivery Platform<\/h3>\n<ul>\n<li><a href=\"https:\/\/codefresh.io\/about-gitops\/codefresh-workflows\">Using Codefresh Workflows for GitOps deployments<\/a><\/li>\n<li><a href=\"https:\/\/codefresh.io\/argo-platform\/applications-dashboard-with-argocd\">Using GitOps, Multiple Argo Instances, and Environments with Argo CD at Scale<\/a><\/li>\n<\/ul>\n<input class=\"fooboxshare_post_id\" type=\"hidden\" value=\"21180\"\/>","protected":false},"excerpt":{"rendered":"<p>This blog post was co-authored by Moran Goldboim, VP of Product at Codefresh. Delivering new software is the single most important function of businesses trying to compete today. Many companies get stuck with flaky scripting, manual interventions, complex processes, and large unreliable tool stacks across diverse infrastructure. Software teams are left scrambling to understand their &hellip; <a href=\"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/\">Read more<\/a><\/p>\n","protected":false},"author":27,"featured_media":21203,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5722],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v17.9 (Yoast SEO v18.4.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Introducing Codefresh Software Delivery Platform, Powered by Argo | Codefresh<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Introducing Codefresh Software Delivery Platform, Powered by Argo\" \/>\n<meta property=\"og:description\" content=\"This blog post was co-authored by Moran Goldboim, VP of Product at Codefresh. Delivering new software is the single most important function of businesses trying to compete today. Many companies get stuck with flaky scripting, manual interventions, complex processes, and large unreliable tool stacks across diverse infrastructure. Software teams are left scrambling to understand their &hellip; Read more\" \/>\n<meta property=\"og:url\" content=\"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/\" \/>\n<meta property=\"og:site_name\" content=\"Codefresh\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/codefresh.io\" \/>\n<meta property=\"article:published_time\" content=\"2022-02-01T07:00:41+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-02-04T00:08:07+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/codefresh-software-delivery-platform-argo-social-1.jpeg\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"628\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@todaywasawesome\" \/>\n<meta name=\"twitter:site\" content=\"@codefresh\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Dan Garfield\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/codefresh.io\/#organization\",\"name\":\"Codefresh\",\"url\":\"https:\/\/codefresh.io\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/codefresh.io\",\"https:\/\/www.linkedin.com\/company\/codefresh\",\"https:\/\/www.youtube.com\/channel\/UC9r94SY6BqN05kXPIHsDXPg\",\"https:\/\/twitter.com\/codefresh\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/codefresh.io\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Codefresh_Logo_Vertical_LightBkgd.png\",\"contentUrl\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Codefresh_Logo_Vertical_LightBkgd.png\",\"width\":800,\"height\":800,\"caption\":\"Codefresh\"},\"image\":{\"@id\":\"https:\/\/codefresh.io\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/codefresh.io\/#website\",\"url\":\"https:\/\/codefresh.io\/\",\"name\":\"Codefresh\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/codefresh.io\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/codefresh.io\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/codefresh-software-delivery-platform-argo-social-1.jpeg\",\"contentUrl\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/codefresh-software-delivery-platform-argo-social-1.jpeg\",\"width\":1200,\"height\":628},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#webpage\",\"url\":\"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/\",\"name\":\"Introducing Codefresh Software Delivery Platform, Powered by Argo | Codefresh\",\"isPartOf\":{\"@id\":\"https:\/\/codefresh.io\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#primaryimage\"},\"datePublished\":\"2022-02-01T07:00:41+00:00\",\"dateModified\":\"2022-02-04T00:08:07+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/codefresh.io\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Introducing Codefresh Software Delivery Platform, Powered by Argo\"}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#webpage\"},\"author\":{\"@id\":\"https:\/\/codefresh.io\/#\/schema\/person\/17aca6389be0f81b999f1b138a0b44a4\"},\"headline\":\"Introducing Codefresh Software Delivery Platform, Powered by Argo\",\"datePublished\":\"2022-02-01T07:00:41+00:00\",\"dateModified\":\"2022-02-04T00:08:07+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#webpage\"},\"wordCount\":2077,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/codefresh.io\/#organization\"},\"image\":{\"@id\":\"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/codefresh-software-delivery-platform.jpeg\",\"articleSection\":[\"Argo Platform\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#respond\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/codefresh.io\/#\/schema\/person\/17aca6389be0f81b999f1b138a0b44a4\",\"name\":\"Dan Garfield\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/codefresh.io\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d4a38809809980ed49dc7e696a8e3938?s=96&d=blank&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d4a38809809980ed49dc7e696a8e3938?s=96&d=blank&r=g\",\"caption\":\"Dan Garfield\"},\"description\":\"Dan is the Co-Founder and Chief Open Source Officer at Codefresh. His work in open source includes being an Argo Maintainer, and co-chair of the GitOps Working Group. As a technology leader with a background in full-stack engineering, evangelism, and communications, he led Codefresh's go-to-market strategy and now leads open source strategy. You can follow him at twitter.com\/todaywasawesome\",\"sameAs\":[\"https:\/\/twitter.com\/todaywasawesome\"],\"url\":\"https:\/\/codefresh.io\/author\/dang\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Introducing Codefresh Software Delivery Platform, Powered by Argo | Codefresh","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/","og_locale":"en_US","og_type":"article","og_title":"Introducing Codefresh Software Delivery Platform, Powered by Argo","og_description":"This blog post was co-authored by Moran Goldboim, VP of Product at Codefresh. Delivering new software is the single most important function of businesses trying to compete today. Many companies get stuck with flaky scripting, manual interventions, complex processes, and large unreliable tool stacks across diverse infrastructure. Software teams are left scrambling to understand their &hellip; Read more","og_url":"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/","og_site_name":"Codefresh","article_publisher":"https:\/\/www.facebook.com\/codefresh.io","article_published_time":"2022-02-01T07:00:41+00:00","article_modified_time":"2022-02-04T00:08:07+00:00","og_image":[{"width":1200,"height":628,"url":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/codefresh-software-delivery-platform-argo-social-1.jpeg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@todaywasawesome","twitter_site":"@codefresh","twitter_misc":{"Written by":"Dan Garfield","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/codefresh.io\/#organization","name":"Codefresh","url":"https:\/\/codefresh.io\/","sameAs":["https:\/\/www.facebook.com\/codefresh.io","https:\/\/www.linkedin.com\/company\/codefresh","https:\/\/www.youtube.com\/channel\/UC9r94SY6BqN05kXPIHsDXPg","https:\/\/twitter.com\/codefresh"],"logo":{"@type":"ImageObject","@id":"https:\/\/codefresh.io\/#logo","inLanguage":"en-US","url":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Codefresh_Logo_Vertical_LightBkgd.png","contentUrl":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Codefresh_Logo_Vertical_LightBkgd.png","width":800,"height":800,"caption":"Codefresh"},"image":{"@id":"https:\/\/codefresh.io\/#logo"}},{"@type":"WebSite","@id":"https:\/\/codefresh.io\/#website","url":"https:\/\/codefresh.io\/","name":"Codefresh","description":"","publisher":{"@id":"https:\/\/codefresh.io\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/codefresh.io\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#primaryimage","inLanguage":"en-US","url":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/codefresh-software-delivery-platform-argo-social-1.jpeg","contentUrl":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/codefresh-software-delivery-platform-argo-social-1.jpeg","width":1200,"height":628},{"@type":"WebPage","@id":"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#webpage","url":"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/","name":"Introducing Codefresh Software Delivery Platform, Powered by Argo | Codefresh","isPartOf":{"@id":"https:\/\/codefresh.io\/#website"},"primaryImageOfPage":{"@id":"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#primaryimage"},"datePublished":"2022-02-01T07:00:41+00:00","dateModified":"2022-02-04T00:08:07+00:00","breadcrumb":{"@id":"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/codefresh.io\/"},{"@type":"ListItem","position":2,"name":"Introducing Codefresh Software Delivery Platform, Powered by Argo"}]},{"@type":"Article","@id":"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#article","isPartOf":{"@id":"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#webpage"},"author":{"@id":"https:\/\/codefresh.io\/#\/schema\/person\/17aca6389be0f81b999f1b138a0b44a4"},"headline":"Introducing Codefresh Software Delivery Platform, Powered by Argo","datePublished":"2022-02-01T07:00:41+00:00","dateModified":"2022-02-04T00:08:07+00:00","mainEntityOfPage":{"@id":"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#webpage"},"wordCount":2077,"commentCount":0,"publisher":{"@id":"https:\/\/codefresh.io\/#organization"},"image":{"@id":"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#primaryimage"},"thumbnailUrl":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/codefresh-software-delivery-platform.jpeg","articleSection":["Argo Platform"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/#respond"]}]},{"@type":"Person","@id":"https:\/\/codefresh.io\/#\/schema\/person\/17aca6389be0f81b999f1b138a0b44a4","name":"Dan Garfield","image":{"@type":"ImageObject","@id":"https:\/\/codefresh.io\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/d4a38809809980ed49dc7e696a8e3938?s=96&d=blank&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d4a38809809980ed49dc7e696a8e3938?s=96&d=blank&r=g","caption":"Dan Garfield"},"description":"Dan is the Co-Founder and Chief Open Source Officer at Codefresh. His work in open source includes being an Argo Maintainer, and co-chair of the GitOps Working Group. As a technology leader with a background in full-stack engineering, evangelism, and communications, he led Codefresh's go-to-market strategy and now leads open source strategy. You can follow him at twitter.com\/todaywasawesome","sameAs":["https:\/\/twitter.com\/todaywasawesome"],"url":"https:\/\/codefresh.io\/author\/dang\/"}]}},"acf":[],"_links":{"self":[{"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/posts\/21180"}],"collection":[{"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/comments?post=21180"}],"version-history":[{"count":8,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/posts\/21180\/revisions"}],"predecessor-version":[{"id":21315,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/posts\/21180\/revisions\/21315"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/media\/21203"}],"wp:attachment":[{"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/media?parent=21180"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/categories?post=21180"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/tags?post=21180"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}