{"id":21805,"date":"2022-03-17T13:19:06","date_gmt":"2022-03-17T13:19:06","guid":{"rendered":"https:\/\/codefresh.io\/?p=21805"},"modified":"2022-03-17T13:19:06","modified_gmt":"2022-03-17T13:19:06","slug":"codefresh-software-delivery-platform-and-the-argo-project","status":"publish","type":"post","link":"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/","title":{"rendered":"Codefresh Software Delivery Platform and the Argo Project"},"content":{"rendered":"<p>After we launched the Codefresh Software Delivery Platform (CSDP) in February, we had a lot of questions from current users and the community about the relationship between CDSP and the Argo projects.<\/p>\n<p>We tried to cover most of the important characteristics of the platform <a href=\"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/\">in the announcement blog post<\/a>, but even then, we got feedback about our Argo offering mainly from two groups of people:<\/p>\n<ol>\n<li>Existing Argo users that wanted to know how Codefresh can help them and what they need to change\/update in their existing Argo installation<\/li>\n<li>People that have not adopted Argo\/GitOps yet and want to know the best possible choice for them.<\/li>\n<\/ol>\n<p>In this blog post, we will talk about the relationship between the Codefresh platform and the Argo project and dispel some common misconceptions about how they fit together.<\/p>\n<h2>Codefresh is an advocate for Open Source and maintains the Argo Project in partnership with the community.<\/h2>\n<p>The Argo Project was first started by Applatix (later acquired by Intuit), and donated to the CNCF in April 2020. Since then, the project has been maintained in a partnership between Codefresh, Intuit, RedHat, and others. At the end of 2020, Codefresh launched Codefresh GitOps, an enterprise offering built on Argo CD and became the first commercial vendor for Argo. <\/p>\n<p>In addition to maintaining the codebase, adding features, doing code reviews etc, we’ve also contributed extensively to documentation, the Argo website, project organization, and donated a new project to Argo Labs (discussed later in this post) called <a href=\"https:\/\/argocd-autopilot.readthedocs.io\/en\/stable\/\">Argo CD Autopilot<\/a>.<\/p>\n<p>As an open-source first company, it’s very important that our contributions are given back to the community, and not only benefit Codefresh users. Of course a subset of the features provide extensibility to our enterprise platform and help improve the management of Argo at scale. All Codefresh contributors work on items that benefit everyone in the community, not just on features directly related to CSDP. <\/p>\n<p> To help the community adopt Argo while following best practices we launched a number of initiatives to educate and train teams on Argo. The first fruits of this effort are now available in the form of our <a href=\"https:\/\/codefresh.io\/codefresh-news\/get-gitops-certified-with-argo\/\">GitOps certification<\/a>. This is the first ever certification specifically targeted at Argo. The first course is already out and the feedback we had was phenomenal not only for the choice of content (we even cover Progressive Delivery with Argo Rollouts) but also the presentation (the interactive labs can be done in your browser).<\/p>\n<p>Another major contribution to the open source community was the launch of the <a href=\"https:\/\/codefresh.io\/argo-platform\/argohub\/\">Codefresh Hub for Argo Workflows<\/a>. We saw the need for an easy way to catalog\/discover\/maintain reusable Argo Workflows and realized that a great benefit to the community would be a centralized repository of curated and versioned Argo Workflow steps. The service is free to use for the whole community and has nothing specific for CSDP. You can use it with a plain Argo Workflows installation. The contents of the Hub <a href=\"https:\/\/github.com\/codefresh-io\/argo-hub\">are open-source as well<\/a> so anybody can contribute.<\/p>\n<p>Codefresh also led the way to create ArgoCon, the first ever Argo Conference which took place in 2021 and boasted over 6,000 participants! <a href=\"https:\/\/blog.argoproj.io\/argocon-21-that-s-a-wrap-on-argo-s-first-conference-a13ce269d033\">This was a huge success<\/a> that further reinforced the idea that the Argo project has a bright future ahead.<\/p>\n<p>We are also always present in all community channels (Slack\/Reddit\/Github discussions) trying to help people with their journey in the GitOps world.<\/p>\n<p>All these initiatives and contributions show just how committed we are to keeping the  Argo Project project open. We are here to help the community and help Argo usage skyrocket among all kinds of organizations. <\/p>\n<p>In summary, Codefresh is currently spending time and effort to help the Argo community is several aspects:<\/p>\n<ul>\n<li>Active Project maintenance and contributors across all Argo projects\t<\/li>\n<li>\nBrand-new project <a href=\"https:\/\/argocd-autopilot.readthedocs.io\/en\/stable\/\">Argo Autopilot<\/a><\/li>\n<li>Launched the first ever Argo\/GitOps certification<\/li>\n<li>Launched the first ever public repository for Argo Workflow steps<\/li>\n<li>Started and organized the first Argo Conference (ArgoCon)<\/li>\n<li>Active engagement with the Argo Community.<\/li>\n<\/ul>\n<h2>The Codefresh Platform is powered by Argo<\/h2>\n<p>Now that we have seen how Codefresh is involved in the open source community, let’s talk about our commercial offering CSDP (Codefresh Software Delivery Platform). <\/p>\n<figure id=\"attachment_21810\" aria-describedby=\"caption-attachment-21810\" style=\"width: 1024px\" class=\"wp-caption alignnone\"><a href=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/Marketecture_Slide_Updated.png\"><img src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/Marketecture_Slide_Updated-1024x515.png\" alt=\"Platform architecture\" width=\"1024\" height=\"515\" class=\"size-large wp-image-21810\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/Marketecture_Slide_Updated-1024x515.png 1024w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/Marketecture_Slide_Updated-300x151.png 300w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/Marketecture_Slide_Updated-768x386.png 768w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/Marketecture_Slide_Updated-1536x773.png 1536w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/Marketecture_Slide_Updated-2048x1030.png 2048w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/Marketecture_Slide_Updated-20x10.png 20w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/a><figcaption id=\"caption-attachment-21810\" class=\"wp-caption-text\">Platform architecture<\/figcaption><\/figure>\n<p>You can see that CSDP is largely open source today with Argo serving as the core with plans to open source additional components already underway. Codefresh enhances the Argo toolset and offers them in several ways (as we will see in the next section), but we haven’t tampered with the Argo Projects in any way.<\/p>\n<p>An important part of the platform is Argo Autopilot. This is our enterprise installer for Argo, that not only offers a streamlined installation experience for all Argo projects but also comes with an opinionated way to upgrade and maintain your Argo instances. Even though this component is a crucial part of the Codefresh platform, we decided to <a href=\"https:\/\/codefresh.io\/about-gitops\/launching-argo-cd-autopilot-opinionated-way-manage-applications-across-environments-using-gitops-scale\/\">fully open source it<\/a> at <a href=\"https:\/\/codefresh.io\/about-gitops\/launching-argo-cd-autopilot-opinionated-way-manage-applications-across-environments-using-gitops-scale\/\">https:\/\/argocd-autopilot.readthedocs.io\/<\/a> so that the whole community can benefit from it (reinforcing our open source commitment as stressed in the previous section).<\/p>\n<p>The major takeaway is that CSDP is <strong>fully compatible with all existing Argo installations<\/strong>. We use the Argo projects behind the scenes in their original form. We haven’t changed any of the projects in a backwards incompatible way.<\/p>\n<p>One of the projects we’re currently working on with the community is a conformance program that will ensure compatibility between the community releases and vendor releases, similar to Kubernetes. You can have confidence workflows, applications, or other resources created for Argo will work in Codefresh.<\/p>\n<p>The Codefresh Platform has several exciting features for new and existing Argo users, but every capability you see is backed in a Git repository according to <a href=\"https:\/\/codefresh.io\/gitops\/\">GitOps principles<\/a>.<\/p>\n<figure id=\"attachment_21811\" aria-describedby=\"caption-attachment-21811\" style=\"width: 1024px\" class=\"wp-caption alignnone\"><a href=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/stored-in-git.png\"><img src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/stored-in-git-1024x658.png\" alt=\"Everything is stored in Git\" width=\"1024\" height=\"658\" class=\"size-large wp-image-21811\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/stored-in-git-1024x658.png 1024w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/stored-in-git-300x193.png 300w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/stored-in-git-768x493.png 768w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/stored-in-git-1536x987.png 1536w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/stored-in-git-2048x1316.png 2048w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/stored-in-git-20x13.png 20w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/a><figcaption id=\"caption-attachment-21811\" class=\"wp-caption-text\">Everything is stored in Git<\/figcaption><\/figure>\n<p>This means that if you are already an expert user of Argo, you will be instantly familiar with the internals of the Codefresh platform.<\/p>\n<p>That being said, even though the Codefresh platform is internally powered by Argo, you don’t need to be an Argo expert to adopt CSDP. In fact, we have made the installation of the platform even easier than manually installing the individual Argo projects.<\/p>\n<p>Therefore the Codefresh platform is appropriate for any kind of organization<\/p>\n<ul>\n<li>If you already use Argo, then there will be a natural migration path to the Codefresh platform<\/li>\n<li>If you are not familiar with the Argo projects, you don’t need to become an expert on them. Codefresh will take care of all the implementation details for you and offer a single control plane for all the individual components with minimal effort on your part<\/li>\n<\/ul>\n<p>It is also important to stress that the Codefresh platform will also be open source <a href=\"https:\/\/codefresh.io\/argo-platform\/announcing-codefresh-argo-platform\/\">as we already announced<\/a>.<\/p>\n<h2>Codefresh Brings Additional Features to Argo<\/h2>\n<p>In the previous section we have seen that the Codefresh Software Delivery platform is based on the Argo projects internally.  The next natural question would be what exactly do we add on top of the Argo projects?<\/p>\n<p>The answer is very simple. The Codefresh Software Delivery Platform adds everything else that you need to cover the FULL software lifecycle as can be seen in the diagram below.<\/p>\n<figure id=\"attachment_21813\" aria-describedby=\"caption-attachment-21813\" style=\"width: 800px\" class=\"wp-caption alignnone\"><a href=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/component.png\"><img src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/component.png\" alt=\"Platform components\" width=\"800\" height=\"629\" class=\"size-full wp-image-21813\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/component.png 800w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/component-300x236.png 300w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/component-768x604.png 768w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/component-20x16.png 20w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><figcaption id=\"caption-attachment-21813\" class=\"wp-caption-text\">Platform components<\/figcaption><\/figure>\n<p>The Argo projects are great at what they do, but they only cover a part of the software lifecycle. Argo CD covers deployment, Rollouts covers progressive Delivery, Workflows\/Events cover basic workflows. But what about secret management, release insight, artifact handling, etc?<br \/>\nThis is where CSDP comes in. We keep the existing Argo projects for their respective strengths, and we enhance them with all the additional functionality needed by any software enterprise.<\/p>\n<p>Modern Enterprises have come to expect an ever increasing list of features from their delivery platform such as:<\/p>\n<ul>\n<li>Artifact storage and management (i.e. containers or binaries) to track all your digital assets<\/li>\n<li>Secret management and credentials rotation for secure access to external services<\/li>\n<li>Security gates and manual approvals for any enterprise workflows<\/li>\n<li>Source code compilation to cover the continuous integration part<\/li>\n<li>Project features and issue reporting so what you always know which feature is deployed where<\/li>\n<li>Environment promotions and release management for deployments with minimal downtime<\/li>\n<li>Insights and analytics to understand your development velocity and release trends<\/li>\n<li>Annotations and metadata so you can simply mark and track your digital assets across the whole software lifecycle<\/li>\n<\/ul>\n<p>All these components must be created from scratch by your organization if you are using just the Argo projects and nothing else. If you adopt CSDP, you get all this out of the box:<\/p>\n<figure id=\"attachment_21814\" aria-describedby=\"caption-attachment-21814\" style=\"width: 960px\" class=\"wp-caption alignnone\"><a href=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/Integrated-Argo-Dashboard.jpeg\"><img src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/Integrated-Argo-Dashboard.jpeg\" alt=\"Codefresh dashboard\" width=\"960\" height=\"540\" class=\"size-full wp-image-21814\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/Integrated-Argo-Dashboard.jpeg 960w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/Integrated-Argo-Dashboard-300x169.jpeg 300w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/Integrated-Argo-Dashboard-768x432.jpeg 768w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/Integrated-Argo-Dashboard-20x11.jpeg 20w\" sizes=\"(max-width: 960px) 100vw, 960px\" \/><\/a><figcaption id=\"caption-attachment-21814\" class=\"wp-caption-text\">Codefresh dashboard<\/figcaption><\/figure>\n<p>It is also worth noting that the Codefresh Platform is adding extra integration points between the existing Argo Projects and also fine tunes their functionality specifically for CI\/CD scenarios. As a quick example, Argo Workflows is a great project but it is currently designed as a generic workflow engine. <\/p>\n<p>If you are trying to build an in-house CI\/CD platform with just Argo Workflows, you will have to spend hundreds of hours to customize the generic workflow engine in order to create a pipeline component that can handle your basic tasks (code compilation, unit testing, security scans). The Codefresh platform does this out of the box. It gives you a turn-key solution for running CI pipelines that are powered by Argo Workflows\/Events under the hood.<\/p>\n<h2>Offering the features needed by an enterprise<\/h2>\n<p>The last point to remember is that apart from adding new features on top of the Argo projects, we also want to offer a turn-key solution for enterprises who want to adopt GitOps. Normally open source support is offered on a best-effort basis, and we realized that several organizations want a single platform that is secure, validated, and supported in an enterprise environment.<\/p>\n<p>This has also guided us to offer extra features that are specifically for enterprises who want to adopt GitOps at scale. As a quick example, the Argo CD dashboard is only managing a single Argo CD instance. If you have 5 installations of Argo CD in your organization, you need to jump around 5 dashboards to understand what is going on. This is very cumbersome and time consuming for big enterprises. The Codefresh platform adds <a href=\"https:\/\/codefresh.io\/argo-platform\/introducing-codefresh-software-delivery-platform-powered-by-argo\/\">a single control plane which groups and aggregates all your Argo CD instances<\/a> in a single dashboard.<\/p>\n<figure id=\"attachment_21815\" aria-describedby=\"caption-attachment-21815\" style=\"width: 1024px\" class=\"wp-caption alignnone\"><a href=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/managing-argo-at-scale-1024x620-1.png\"><img src=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/managing-argo-at-scale-1024x620-1.png\" alt=\"Argo at Scale\" width=\"1024\" height=\"620\" class=\"size-full wp-image-21815\" srcset=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/managing-argo-at-scale-1024x620-1.png 1024w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/managing-argo-at-scale-1024x620-1-300x182.png 300w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/managing-argo-at-scale-1024x620-1-768x465.png 768w, https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/managing-argo-at-scale-1024x620-1-20x12.png 20w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/a><figcaption id=\"caption-attachment-21815\" class=\"wp-caption-text\">Argo at Scale<\/figcaption><\/figure>\n<p>To summarize, the Codefresh Software Delivery Platform includes all 4 Argo projects at its core but at the same time:<\/p>\n<ul>\n<li>Unifies all of them with common integration points<\/li>\n<li>Customizes individual components specifically for CI\/CD\/GitOps<\/li>\n<li>Introduces a unified way to install and manage them<\/li>\n<li>Provides a single control and view plane for all of them<\/li>\n<li>Adds the extra integrations missing in order to handle the full application lifecycle<\/li>\n<li>Augments the basic capability with extra dashboards for full traceability<\/li>\n<li>Provides frequent security updates with a well-defined schedule<\/li>\n<li>Satisfies all the expectations of Enterprise software such as SSO, support, auditing, etc.<\/li>\n<\/ul>\n<p>Essentially the Codefresh Software Delivery Platform not only enhances the existing Argo projects but also adds brand new functionality for a full deployment solution.<\/p>\n<p>Try the Community edition for free at <a href=\"https:\/\/codefresh.io\/product\/\">https:\/\/codefresh.io\/product\/ <\/a><\/p>\n<input class=\"fooboxshare_post_id\" type=\"hidden\" value=\"21805\"\/>","protected":false},"excerpt":{"rendered":"<p>After we launched the Codefresh Software Delivery Platform (CSDP) in February, we had a lot of questions from current users and the community about the relationship between CDSP and the Argo projects. We tried to cover most of the important characteristics of the platform in the announcement blog post, but even then, we got feedback &hellip; <a href=\"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/\">Read more<\/a><\/p>\n","protected":false},"author":62,"featured_media":21807,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5722,41],"tags":[5507,5565,5716,5724,5726],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v17.9 (Yoast SEO v18.4.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Codefresh Software Delivery Platform and the Argo Project<\/title>\n<meta name=\"description\" content=\"Learn about the relationship between the Codefresh platform and the Argo project and how they fit together.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Codefresh Software Delivery Platform and the Argo Project\" \/>\n<meta property=\"og:description\" content=\"Learn about the relationship between the Codefresh platform and the Argo project and how they fit together.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/\" \/>\n<meta property=\"og:site_name\" content=\"Codefresh\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/codefresh.io\" \/>\n<meta property=\"article:published_time\" content=\"2022-03-17T13:19:06+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/CSDP_ArgoCD_Linkedin_Header.png\" \/>\n\t<meta property=\"og:image:width\" content=\"2400\" \/>\n\t<meta property=\"og:image:height\" content=\"1254\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:description\" content=\"Learn about the relationship between the Codefresh platform and the Argo project and how they fit together.\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/CSDP_ArgoCD_Linkedin_Header.png\" \/>\n<meta name=\"twitter:creator\" content=\"@codefresh\" \/>\n<meta name=\"twitter:site\" content=\"@codefresh\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Kostis Kapelonis\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/codefresh.io\/#organization\",\"name\":\"Codefresh\",\"url\":\"https:\/\/codefresh.io\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/codefresh.io\",\"https:\/\/www.linkedin.com\/company\/codefresh\",\"https:\/\/www.youtube.com\/channel\/UC9r94SY6BqN05kXPIHsDXPg\",\"https:\/\/twitter.com\/codefresh\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/codefresh.io\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Codefresh_Logo_Vertical_LightBkgd.png\",\"contentUrl\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Codefresh_Logo_Vertical_LightBkgd.png\",\"width\":800,\"height\":800,\"caption\":\"Codefresh\"},\"image\":{\"@id\":\"https:\/\/codefresh.io\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/codefresh.io\/#website\",\"url\":\"https:\/\/codefresh.io\/\",\"name\":\"Codefresh\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/codefresh.io\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/codefresh.io\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/CSDP_ArgoCD_Linkedin_Header.png\",\"contentUrl\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/CSDP_ArgoCD_Linkedin_Header.png\",\"width\":2400,\"height\":1254},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#webpage\",\"url\":\"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/\",\"name\":\"Codefresh Software Delivery Platform and the Argo Project\",\"isPartOf\":{\"@id\":\"https:\/\/codefresh.io\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#primaryimage\"},\"datePublished\":\"2022-03-17T13:19:06+00:00\",\"dateModified\":\"2022-03-17T13:19:06+00:00\",\"description\":\"Learn about the relationship between the Codefresh platform and the Argo project and how they fit together.\",\"breadcrumb\":{\"@id\":\"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/codefresh.io\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Codefresh Software Delivery Platform and the Argo Project\"}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#webpage\"},\"author\":{\"@id\":\"https:\/\/codefresh.io\/#\/schema\/person\/b2f763eca5adecaee359ad3170055d87\"},\"headline\":\"Codefresh Software Delivery Platform and the Argo Project\",\"datePublished\":\"2022-03-17T13:19:06+00:00\",\"dateModified\":\"2022-03-17T13:19:06+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#webpage\"},\"wordCount\":1883,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/codefresh.io\/#organization\"},\"image\":{\"@id\":\"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/CSDP_ArgoCD_Blog_Header.png\",\"keywords\":[\"ArgoCD\",\"Argo Rollouts\",\"autopilot\",\"Codefresh Argo Platform\",\"argo workflows\"],\"articleSection\":[\"Argo Platform\",\"Codefresh News\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#respond\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/codefresh.io\/#\/schema\/person\/b2f763eca5adecaee359ad3170055d87\",\"name\":\"Kostis Kapelonis\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/codefresh.io\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/branded-96x96.png\",\"contentUrl\":\"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/branded-96x96.png\",\"caption\":\"Kostis Kapelonis\"},\"description\":\"Kostis is a software engineer\/technical-writer dual class character. He lives and breathes automation, good testing practices and stress-free deployments with GitOps.\",\"url\":\"https:\/\/codefresh.io\/author\/kostiscodefresh-io\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Codefresh Software Delivery Platform and the Argo Project","description":"Learn about the relationship between the Codefresh platform and the Argo project and how they fit together.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/","og_locale":"en_US","og_type":"article","og_title":"Codefresh Software Delivery Platform and the Argo Project","og_description":"Learn about the relationship between the Codefresh platform and the Argo project and how they fit together.","og_url":"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/","og_site_name":"Codefresh","article_publisher":"https:\/\/www.facebook.com\/codefresh.io","article_published_time":"2022-03-17T13:19:06+00:00","og_image":[{"width":2400,"height":1254,"url":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/CSDP_ArgoCD_Linkedin_Header.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_description":"Learn about the relationship between the Codefresh platform and the Argo project and how they fit together.","twitter_image":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/CSDP_ArgoCD_Linkedin_Header.png","twitter_creator":"@codefresh","twitter_site":"@codefresh","twitter_misc":{"Written by":"Kostis Kapelonis","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/codefresh.io\/#organization","name":"Codefresh","url":"https:\/\/codefresh.io\/","sameAs":["https:\/\/www.facebook.com\/codefresh.io","https:\/\/www.linkedin.com\/company\/codefresh","https:\/\/www.youtube.com\/channel\/UC9r94SY6BqN05kXPIHsDXPg","https:\/\/twitter.com\/codefresh"],"logo":{"@type":"ImageObject","@id":"https:\/\/codefresh.io\/#logo","inLanguage":"en-US","url":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Codefresh_Logo_Vertical_LightBkgd.png","contentUrl":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/02\/Codefresh_Logo_Vertical_LightBkgd.png","width":800,"height":800,"caption":"Codefresh"},"image":{"@id":"https:\/\/codefresh.io\/#logo"}},{"@type":"WebSite","@id":"https:\/\/codefresh.io\/#website","url":"https:\/\/codefresh.io\/","name":"Codefresh","description":"","publisher":{"@id":"https:\/\/codefresh.io\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/codefresh.io\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#primaryimage","inLanguage":"en-US","url":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/CSDP_ArgoCD_Linkedin_Header.png","contentUrl":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/CSDP_ArgoCD_Linkedin_Header.png","width":2400,"height":1254},{"@type":"WebPage","@id":"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#webpage","url":"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/","name":"Codefresh Software Delivery Platform and the Argo Project","isPartOf":{"@id":"https:\/\/codefresh.io\/#website"},"primaryImageOfPage":{"@id":"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#primaryimage"},"datePublished":"2022-03-17T13:19:06+00:00","dateModified":"2022-03-17T13:19:06+00:00","description":"Learn about the relationship between the Codefresh platform and the Argo project and how they fit together.","breadcrumb":{"@id":"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/codefresh.io\/"},{"@type":"ListItem","position":2,"name":"Codefresh Software Delivery Platform and the Argo Project"}]},{"@type":"Article","@id":"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#article","isPartOf":{"@id":"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#webpage"},"author":{"@id":"https:\/\/codefresh.io\/#\/schema\/person\/b2f763eca5adecaee359ad3170055d87"},"headline":"Codefresh Software Delivery Platform and the Argo Project","datePublished":"2022-03-17T13:19:06+00:00","dateModified":"2022-03-17T13:19:06+00:00","mainEntityOfPage":{"@id":"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#webpage"},"wordCount":1883,"commentCount":0,"publisher":{"@id":"https:\/\/codefresh.io\/#organization"},"image":{"@id":"https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#primaryimage"},"thumbnailUrl":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/CSDP_ArgoCD_Blog_Header.png","keywords":["ArgoCD","Argo Rollouts","autopilot","Codefresh Argo Platform","argo workflows"],"articleSection":["Argo Platform","Codefresh News"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/codefresh.io\/argo-platform\/codefresh-software-delivery-platform-and-the-argo-project\/#respond"]}]},{"@type":"Person","@id":"https:\/\/codefresh.io\/#\/schema\/person\/b2f763eca5adecaee359ad3170055d87","name":"Kostis Kapelonis","image":{"@type":"ImageObject","@id":"https:\/\/codefresh.io\/#personlogo","inLanguage":"en-US","url":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/branded-96x96.png","contentUrl":"https:\/\/codefresh.io\/wp-content\/uploads\/2022\/03\/branded-96x96.png","caption":"Kostis Kapelonis"},"description":"Kostis is a software engineer\/technical-writer dual class character. He lives and breathes automation, good testing practices and stress-free deployments with GitOps.","url":"https:\/\/codefresh.io\/author\/kostiscodefresh-io\/"}]}},"acf":[],"_links":{"self":[{"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/posts\/21805"}],"collection":[{"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/users\/62"}],"replies":[{"embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/comments?post=21805"}],"version-history":[{"count":5,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/posts\/21805\/revisions"}],"predecessor-version":[{"id":21817,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/posts\/21805\/revisions\/21817"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/media\/21807"}],"wp:attachment":[{"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/media?parent=21805"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/categories?post=21805"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/codefresh.io\/wp-json\/wp\/v2\/tags?post=21805"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}